{
    "2212.11870": {
        "paper_id": "2212.11870",
        "abs_url": "https://arxiv.org/abs/2212.11870",
        "pdf_url": "https://arxiv.org/pdf/2212.11870.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2212.11870_Impossibility_Theorems_for_Feature_Attribution.pdf",
        "title": "Impossibility Theorems for Feature Attribution",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Blair Bilodeau",
            "Natasha Jaques",
            "Pang Wei Koh",
            "Been Kim"
        ],
        "abstract": "Despite a sea of interpretability methods that can produce plausible explanations, the field has also empirically seen many failure cases of such methods. In light of these results, it remains unclear for practitioners how to use these methods and choose between them in a principled way. In this paper, we show that for moderately rich model classes (easily satisfied by neural networks), any feature attribution method that is complete and linear -- for example, Integrated Gradients and SHAP -- can provably fail to improve on random guessing for inferring model behaviour. Our results apply to common end-tasks such as characterizing local model behaviour, identifying spurious features, and algorithmic recourse. One takeaway from our work is the importance of concretely defining end-tasks: once such an end-task is defined, a simple and direct approach of repeated model evaluations can outperform many other complex feature attribution methods.",
        "comments": "38 pages, 4 figures. Updated for PNAS publication",
        "official_code_urls": [
            "https://github.com/google-research/interpretability-theory"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/impossibility-theorems-for-feature",
        "bibtex": "@misc{bilodeau2024impossibility,\n      title={Impossibility Theorems for Feature Attribution}, \n      author={Blair Bilodeau and Natasha Jaques and Pang Wei Koh and Been Kim},\n      year={2024},\n      eprint={2212.11870},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}